stm32duino/Arduino_Core_STM32/boards.txt
GenF1.menu.pnum.BLACKPILL_F103CB=BlackPill F103CB (or C8 with 128k)
GenF1.menu.pnum.BLACKPILL_F103CB.upload.maximum_size=131072
GenF1.menu.pnum.BLACKPILL_F103CB.upload.maximum_data_size=20480
GenF1.menu.pnum.BLACKPILL_F103CB.build.board=BLACKPILL_F103CB
GenF1.menu.pnum.BLACKPILL_F103CB.build.product_line=STM32F103xB
GenF1.menu.pnum.BLACKPILL_F103CB.build.variant_h=variant_PILL_F103Cx.h
GenF1.menu.pnum.BLACKPILL_F103CB.build.variant=STM32F1xx/F103C8T_F103CB(T-U)

# VCCGND_F103ZET6_MINI board
GenF1.menu.pnum.VCCGND_F103ZET6_MINI=VCCGND F103ZET6 Mini
GenF1.menu.pnum.VCCGND_F103ZET6_MINI.upload.maximum_size=524288
GenF1.menu.pnum.VCCGND_F103ZET6_MINI.upload.maximum_data_size=65536
GenF1.menu.pnum.VCCGND_F103ZET6_MINI.build.board=VCCGND_F103ZET6_MINI
GenF1.menu.pnum.VCCGND_F103ZET6_MINI.build.product_line=STM32F103xE
GenF1.menu.pnum.VCCGND_F103ZET6_MINI.build.variant=STM32F1xx/F103Z(C-D-E)(H-T)
GenF1.menu.pnum.VCCGND_F103ZET6_MINI.build.variant_h=variant_{build.board}.h

# VCCGND_F103ZET6 board
GenF1.menu.pnum.VCCGND_F103ZET6=VCCGND F103ZET6
GenF1.menu.pnum.VCCGND_F103ZET6.upload.maximum_size=524288
GenF1.menu.pnum.VCCGND_F103ZET6.upload.maximum_data_size=65536
GenF1.menu.pnum.VCCGND_F103ZET6.build.board=VCCGND_F103ZET6
GenF1.menu.pnum.VCCGND_F103ZET6.build.product_line=STM32F103xE
GenF1.menu.pnum.VCCGND_F103ZET6.build.variant=STM32F1xx/F103Z(C-D-E)(H-T)
GenF1.menu.pnum.VCCGND_F103ZET6.build.variant_h=variant_{build.board}.h

# HY-TinySTM103TB board
GenF1.menu.pnum.HY_TINYSTM103TB=HY-TinySTM103TB
GenF1.menu.pnum.HY_TINYSTM103TB.upload.maximum_size=131072
GenF1.menu.pnum.HY_TINYSTM103TB.upload.maximum_data_size=20480
GenF1.menu.pnum.HY_TINYSTM103TB.build.board=HY_TINYSTM103TB
GenF1.menu.pnum.HY_TINYSTM103TB.build.product_line=STM32F103xB
GenF1.menu.pnum.HY_TINYSTM103TB.build.variant_h=variant_{build.board}.h
GenF1.menu.pnum.HY_TINYSTM103TB.build.variant=STM32F1xx/F103T(8-B)U

# MAPLEMINI_F103CB board
GenF1.menu.pnum.MAPLEMINI_F103CB=Maple Mini F103CB
GenF1.menu.pnum.MAPLEMINI_F103CB.upload.maximum_size=131072
GenF1.menu.pnum.MAPLEMINI_F103CB.upload.maximum_data_size=20480
GenF1.menu.pnum.MAPLEMINI_F103CB.build.board=MAPLEMINI_F103CB
GenF1.menu.pnum.MAPLEMINI_F103CB.build.product_line=STM32F103xB
GenF1.menu.pnum.MAPLEMINI_F103CB.build.variant_h=variant_{build.board}.h
GenF1.menu.pnum.MAPLEMINI_F103CB.build.variant=STM32F1xx/F103C8T_F103CB(T-U)

# Blue Button F103R8T board
GenF1.menu.pnum.BLUEBUTTON_F103R8T=Blue Button F103R8T
GenF1.menu.pnum.BLUEBUTTON_F103R8T.upload.maximum_size=65536
GenF1.menu.pnum.BLUEBUTTON_F103R8T.upload.maximum_data_size=20480
GenF1.menu.pnum.BLUEBUTTON_F103R8T.build.board=BLUEBUTTON_F103R8T
GenF1.menu.pnum.BLUEBUTTON_F103R8T.build.product_line=STM32F103xB
GenF1.menu.pnum.BLUEBUTTON_F103R8T.build.variant=STM32F1xx/F103R(8-B)T
GenF1.menu.pnum.BLUEBUTTON_F103R8T.build.variant_h=variant_{build.board}.h

# Blue Button F103RBT board
GenF1.menu.pnum.BLUEBUTTON_F103RBT=Blue Button F103RBT
GenF1.menu.pnum.BLUEBUTTON_F103RBT.upload.maximum_size=131072
GenF1.menu.pnum.BLUEBUTTON_F103RBT.upload.maximum_data_size=20480
GenF1.menu.pnum.BLUEBUTTON_F103RBT.build.board=BLUEBUTTON_F103RBT
GenF1.menu.pnum.BLUEBUTTON_F103RBT.build.product_line=STM32F103xB
GenF1.menu.pnum.BLUEBUTTON_F103RBT.build.variant=STM32F1xx/F103R(8-B)T
GenF1.menu.pnum.BLUEBUTTON_F103RBT.build.variant_h=variant_{build.board}.h

# Blue Button F103RCT board
GenF1.menu.pnum.BLUEBUTTON_F103RCT=Blue Button F103RCT
GenF1.menu.pnum.BLUEBUTTON_F103RCT.upload.maximum_size=262144
GenF1.menu.pnum.BLUEBUTTON_F103RCT.upload.maximum_data_size=49152
GenF1.menu.pnum.BLUEBUTTON_F103RCT.build.board=BLUEBUTTON_F103RCT
GenF1.menu.pnum.BLUEBUTTON_F103RCT.build.product_line=STM32F103xE
GenF1.menu.pnum.BLUEBUTTON_F103RCT.build.variant=STM32F1xx/F103R(C-D-E)T
GenF1.menu.pnum.BLUEBUTTON_F103RCT.build.variant_h=variant_{build.board}.h

# Blue Button F103RET board
GenF1.menu.pnum.BLUEBUTTON_F103RET=Blue Button F103RET
GenF1.menu.pnum.BLUEBUTTON_F103RET.upload.maximum_size=524288
GenF1.menu.pnum.BLUEBUTTON_F103RET.upload.maximum_data_size=65536
GenF1.menu.pnum.BLUEBUTTON_F103RET.build.board=BLUEBUTTON_F103RET
GenF1.menu.pnum.BLUEBUTTON_F103RET.build.product_line=STM32F103xE
GenF1.menu.pnum.BLUEBUTTON_F103RET.build.variant=STM32F1xx/F103R(C-D-E)T
GenF1.menu.pnum.BLUEBUTTON_F103RET.build.variant_h=variant_{build.board}.h

# Generic F100C4Tx
GenF1.menu.pnum.GENERIC_F100C4TX=Generic F100C4Tx
GenF1.menu.pnum.GENERIC_F100C4TX.upload.maximum_size=16384
GenF1.menu.pnum.GENERIC_F100C4TX.upload.maximum_data_size=4096
GenF1.menu.pnum.GENERIC_F100C4TX.build.board=GENERIC_F100C4TX
GenF1.menu.pnum.GENERIC_F100C4TX.build.product_line=STM32F100xB
GenF1.menu.pnum.GENERIC_F100C4TX.build.variant=STM32F1xx/F100C(4-6)T

# Generic F100C6Tx
GenF1.menu.pnum.GENERIC_F100C6TX=Generic F100C6Tx
GenF1.menu.pnum.GENERIC_F100C6TX.upload.maximum_size=32768
GenF1.menu.pnum.GENERIC_F100C6TX.upload.maximum_data_size=4096
GenF1.menu.pnum.GENERIC_F100C6TX.build.board=GENERIC_F100C6TX
GenF1.menu.pnum.GENERIC_F100C6TX.build.product_line=STM32F100xB
GenF1.menu.pnum.GENERIC_F100C6TX.build.variant=STM32F1xx/F100C(4-6)T

# Generic F100C8Tx
GenF1.menu.pnum.GENERIC_F100C8TX=Generic F100C8Tx
GenF1.menu.pnum.GENERIC_F100C8TX.upload.maximum_size=65536
GenF1.menu.pnum.GENERIC_F100C8TX.upload.maximum_data_size=8192
GenF1.menu.pnum.GENERIC_F100C8TX.build.board=GENERIC_F100C8TX
GenF1.menu.pnum.GENERIC_F100C8TX.build.product_line=STM32F100xB
GenF1.menu.pnum.GENERIC_F100C8TX.build.variant=STM32F1xx/F100C(8-B)T

# Generic F100CBTx
GenF1.menu.pnum.GENERIC_F100CBTX=Generic F100CBTx
GenF1.menu.pnum.GENERIC_F100CBTX.upload.maximum_size=131072
GenF1.menu.pnum.GENERIC_F100CBTX.upload.maximum_data_size=8192
GenF1.menu.pnum.GENERIC_F100CBTX.build.board=GENERIC_F100CBTX
GenF1.menu.pnum.GENERIC_F100CBTX.build.product_line=STM32F100xB
GenF1.menu.pnum.GENERIC_F100CBTX.build.variant=STM32F1xx/F100C(8-B)T

# Generic F100R8Tx
GenF1.menu.pnum.GENERIC_F100R8TX=Generic F100R8Tx
GenF1.menu.pnum.GENERIC_F100R8TX.upload.maximum_size=65536
GenF1.menu.pnum.GENERIC_F100R8TX.upload.maximum_data_size=8192
GenF1.menu.pnum.GENERIC_F100R8TX.build.board=GENERIC_F100R8TX
GenF1.menu.pnum.GENERIC_F100R8TX.build.product_line=STM32F100xB
GenF1.menu.pnum.GENERIC_F100R8TX.build.variant=STM32F1xx/F100R(8-B)T

# Generic F100RBTx
GenF1.menu.pnum.GENERIC_F100RBTX=Generic F100RBTx
GenF1.menu.pnum.GENERIC_F100RBTX.upload.maximum_size=131072
GenF1.menu.pnum.GENERIC_F100RBTX.upload.maximum_data_size=8192
GenF1.menu.pnum.GENERIC_F100RBTX.build.board=GENERIC_F100RBTX
GenF1.menu.pnum.GENERIC_F100RBTX.build.product_line=STM32F100xB
GenF1.menu.pnum.GENERIC_F100RBTX.build.variant=STM32F1xx/F100R(8-B)T

# Generic F103C4Tx
GenF1.menu.pnum.GENERIC_F103C4TX=Generic F103C4Tx
GenF1.menu.pnum.GENERIC_F103C4TX.upload.maximum_size=16384
GenF1.menu.pnum.GENERIC_F103C4TX.upload.maximum_data_size=6144
GenF1.menu.pnum.GENERIC_F103C4TX.build.board=GENERIC_F103C4TX
GenF1.menu.pnum.GENERIC_F103C4TX.build.product_line=STM32F103x6
GenF1.menu.pnum.GENERIC_F103C4TX.build.variant=STM32F1xx/F103C4T_F103C6(T-U)

