stm32duino/Arduino_Core_STM32/boards.txt
# Generic F401CDUx
GenF4.menu.pnum.GENERIC_F401CDUX=Generic F401CDUx
GenF4.menu.pnum.GENERIC_F401CDUX.upload.maximum_size=393216
GenF4.menu.pnum.GENERIC_F401CDUX.upload.maximum_data_size=98304
GenF4.menu.pnum.GENERIC_F401CDUX.build.board=GENERIC_F401CDUX
GenF4.menu.pnum.GENERIC_F401CDUX.build.product_line=STM32F401xE
GenF4.menu.pnum.GENERIC_F401CDUX.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)

# Generic F401CEUx
GenF4.menu.pnum.GENERIC_F401CEUX=Generic F401CEUx
GenF4.menu.pnum.GENERIC_F401CEUX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F401CEUX.upload.maximum_data_size=98304
GenF4.menu.pnum.GENERIC_F401CEUX.build.board=GENERIC_F401CEUX
GenF4.menu.pnum.GENERIC_F401CEUX.build.product_line=STM32F401xE
GenF4.menu.pnum.GENERIC_F401CEUX.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)

# Generic F401CDYx
GenF4.menu.pnum.GENERIC_F401CDYX=Generic F401CDYx
GenF4.menu.pnum.GENERIC_F401CDYX.upload.maximum_size=393216
GenF4.menu.pnum.GENERIC_F401CDYX.upload.maximum_data_size=98304
GenF4.menu.pnum.GENERIC_F401CDYX.build.board=GENERIC_F401CDYX
GenF4.menu.pnum.GENERIC_F401CDYX.build.product_line=STM32F401xE
GenF4.menu.pnum.GENERIC_F401CDYX.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)

# Generic F401CEYx
GenF4.menu.pnum.GENERIC_F401CEYX=Generic F401CEYx
GenF4.menu.pnum.GENERIC_F401CEYX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F401CEYX.upload.maximum_data_size=98304
GenF4.menu.pnum.GENERIC_F401CEYX.build.board=GENERIC_F401CEYX
GenF4.menu.pnum.GENERIC_F401CEYX.build.product_line=STM32F401xE
GenF4.menu.pnum.GENERIC_F401CEYX.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)

# Generic F401CCFx
GenF4.menu.pnum.GENERIC_F401CCFX=Generic F401CCFx
GenF4.menu.pnum.GENERIC_F401CCFX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F401CCFX.upload.maximum_data_size=65536
GenF4.menu.pnum.GENERIC_F401CCFX.build.board=GENERIC_F401CCFX
GenF4.menu.pnum.GENERIC_F401CCFX.build.product_line=STM32F401xC
GenF4.menu.pnum.GENERIC_F401CCFX.build.variant=STM32F4xx/F401CC(F-U-Y)_F401C(B-D-E)(U-Y)

# Generic F401RBTx
GenF4.menu.pnum.GENERIC_F401RBTX=Generic F401RBTx
GenF4.menu.pnum.GENERIC_F401RBTX.upload.maximum_size=131072
GenF4.menu.pnum.GENERIC_F401RBTX.upload.maximum_data_size=65536
GenF4.menu.pnum.GENERIC_F401RBTX.build.board=GENERIC_F401RBTX
GenF4.menu.pnum.GENERIC_F401RBTX.build.product_line=STM32F401xC
GenF4.menu.pnum.GENERIC_F401RBTX.build.variant=STM32F4xx/F401R(B-C-D-E)T

# Generic F401RCTx
GenF4.menu.pnum.GENERIC_F401RCTX=Generic F401RCTx
GenF4.menu.pnum.GENERIC_F401RCTX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F401RCTX.upload.maximum_data_size=65536
GenF4.menu.pnum.GENERIC_F401RCTX.build.board=GENERIC_F401RCTX
GenF4.menu.pnum.GENERIC_F401RCTX.build.product_line=STM32F401xC
GenF4.menu.pnum.GENERIC_F401RCTX.build.variant=STM32F4xx/F401R(B-C-D-E)T

# Generic F401RDTx
GenF4.menu.pnum.GENERIC_F401RDTX=Generic F401RDTx
GenF4.menu.pnum.GENERIC_F401RDTX.upload.maximum_size=393216
GenF4.menu.pnum.GENERIC_F401RDTX.upload.maximum_data_size=98304
GenF4.menu.pnum.GENERIC_F401RDTX.build.board=GENERIC_F401RDTX
GenF4.menu.pnum.GENERIC_F401RDTX.build.product_line=STM32F401xE
GenF4.menu.pnum.GENERIC_F401RDTX.build.variant=STM32F4xx/F401R(B-C-D-E)T

# Generic F401RETx
GenF4.menu.pnum.GENERIC_F401RETX=Generic F401RETx
GenF4.menu.pnum.GENERIC_F401RETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F401RETX.upload.maximum_data_size=98304
GenF4.menu.pnum.GENERIC_F401RETX.build.board=GENERIC_F401RETX
GenF4.menu.pnum.GENERIC_F401RETX.build.product_line=STM32F401xE
GenF4.menu.pnum.GENERIC_F401RETX.build.variant=STM32F4xx/F401R(B-C-D-E)T

# Generic F401VBTx
GenF4.menu.pnum.GENERIC_F401VBTX=Generic F401VBTx
GenF4.menu.pnum.GENERIC_F401VBTX.upload.maximum_size=131072
GenF4.menu.pnum.GENERIC_F401VBTX.upload.maximum_data_size=65536
GenF4.menu.pnum.GENERIC_F401VBTX.build.board=GENERIC_F401VBTX
GenF4.menu.pnum.GENERIC_F401VBTX.build.product_line=STM32F401xC
GenF4.menu.pnum.GENERIC_F401VBTX.build.variant=STM32F4xx/F401V(B-C-D-E)T

# Generic F401VCTx
GenF4.menu.pnum.GENERIC_F401VCTX=Generic F401VCTx
GenF4.menu.pnum.GENERIC_F401VCTX.upload.maximum_size=262144
GenF4.menu.pnum.GENERIC_F401VCTX.upload.maximum_data_size=65536
GenF4.menu.pnum.GENERIC_F401VCTX.build.board=GENERIC_F401VCTX
GenF4.menu.pnum.GENERIC_F401VCTX.build.product_line=STM32F401xC
GenF4.menu.pnum.GENERIC_F401VCTX.build.variant=STM32F4xx/F401V(B-C-D-E)T

# Generic F401VDTx
GenF4.menu.pnum.GENERIC_F401VDTX=Generic F401VDTx
GenF4.menu.pnum.GENERIC_F401VDTX.upload.maximum_size=393216
GenF4.menu.pnum.GENERIC_F401VDTX.upload.maximum_data_size=98304
GenF4.menu.pnum.GENERIC_F401VDTX.build.board=GENERIC_F401VDTX
GenF4.menu.pnum.GENERIC_F401VDTX.build.product_line=STM32F401xE
GenF4.menu.pnum.GENERIC_F401VDTX.build.variant=STM32F4xx/F401V(B-C-D-E)T

# Generic F401VETx
GenF4.menu.pnum.GENERIC_F401VETX=Generic F401VETx
GenF4.menu.pnum.GENERIC_F401VETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F401VETX.upload.maximum_data_size=98304
GenF4.menu.pnum.GENERIC_F401VETX.build.board=GENERIC_F401VETX
GenF4.menu.pnum.GENERIC_F401VETX.build.product_line=STM32F401xE
GenF4.menu.pnum.GENERIC_F401VETX.build.variant=STM32F4xx/F401V(B-C-D-E)T

# Generic F405RGTx
GenF4.menu.pnum.GENERIC_F405RGTX=Generic F405RGTx
GenF4.menu.pnum.GENERIC_F405RGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F405RGTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F405RGTX.build.board=GENERIC_F405RGTX
GenF4.menu.pnum.GENERIC_F405RGTX.build.product_line=STM32F405xx
GenF4.menu.pnum.GENERIC_F405RGTX.build.variant=STM32F4xx/F405RGT_F415RGT

# Generic F407VETx
GenF4.menu.pnum.GENERIC_F407VETX=Generic F407VETx
GenF4.menu.pnum.GENERIC_F407VETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F407VETX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F407VETX.build.board=GENERIC_F407VETX
GenF4.menu.pnum.GENERIC_F407VETX.build.product_line=STM32F407xx
GenF4.menu.pnum.GENERIC_F407VETX.build.variant=STM32F4xx/F407V(E-G)T_F417V(E-G)T

# Generic F407VGTx
GenF4.menu.pnum.GENERIC_F407VGTX=Generic F407VGTx
GenF4.menu.pnum.GENERIC_F407VGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F407VGTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F407VGTX.build.board=GENERIC_F407VGTX
GenF4.menu.pnum.GENERIC_F407VGTX.build.product_line=STM32F407xx
GenF4.menu.pnum.GENERIC_F407VGTX.build.variant=STM32F4xx/F407V(E-G)T_F417V(E-G)T

# Generic F407ZETx
GenF4.menu.pnum.GENERIC_F407ZETX=Generic F407ZETx
GenF4.menu.pnum.GENERIC_F407ZETX.upload.maximum_size=524288
GenF4.menu.pnum.GENERIC_F407ZETX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F407ZETX.build.board=GENERIC_F407ZETX
GenF4.menu.pnum.GENERIC_F407ZETX.build.product_line=STM32F407xx
GenF4.menu.pnum.GENERIC_F407ZETX.build.variant=STM32F4xx/F407Z(E-G)T_F417Z(E-G)T

# Generic F407ZGTx
GenF4.menu.pnum.GENERIC_F407ZGTX=Generic F407ZGTx
GenF4.menu.pnum.GENERIC_F407ZGTX.upload.maximum_size=1048576
GenF4.menu.pnum.GENERIC_F407ZGTX.upload.maximum_data_size=131072
GenF4.menu.pnum.GENERIC_F407ZGTX.build.board=GENERIC_F407ZGTX
GenF4.menu.pnum.GENERIC_F407ZGTX.build.product_line=STM32F407xx
GenF4.menu.pnum.GENERIC_F407ZGTX.build.variant=STM32F4xx/F407Z(E-G)T_F417Z(E-G)T

