stm32duino/Arduino_Core_STM32/boards.txt
# Generic H742VGTx
GenH7.menu.pnum.GENERIC_H742VGTX=Generic H742VGTx
GenH7.menu.pnum.GENERIC_H742VGTX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H742VGTX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H742VGTX.build.board=GENERIC_H742VGTX
GenH7.menu.pnum.GENERIC_H742VGTX.build.product_line=STM32H742xx
GenH7.menu.pnum.GENERIC_H742VGTX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)

# Generic H742VITx
GenH7.menu.pnum.GENERIC_H742VITX=Generic H742VITx
GenH7.menu.pnum.GENERIC_H742VITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H742VITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H742VITX.build.board=GENERIC_H742VITX
GenH7.menu.pnum.GENERIC_H742VITX.build.product_line=STM32H742xx
GenH7.menu.pnum.GENERIC_H742VITX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)

# Generic H742ZGTx
GenH7.menu.pnum.GENERIC_H742ZGTX=Generic H742ZGTx
GenH7.menu.pnum.GENERIC_H742ZGTX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H742ZGTX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H742ZGTX.build.board=GENERIC_H742ZGTX
GenH7.menu.pnum.GENERIC_H742ZGTX.build.product_line=STM32H742xx
GenH7.menu.pnum.GENERIC_H742ZGTX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Generic H742ZITx
GenH7.menu.pnum.GENERIC_H742ZITX=Generic H742ZITx
GenH7.menu.pnum.GENERIC_H742ZITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H742ZITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H742ZITX.build.board=GENERIC_H742ZITX
GenH7.menu.pnum.GENERIC_H742ZITX.build.product_line=STM32H742xx
GenH7.menu.pnum.GENERIC_H742ZITX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Generic H743IGKx
GenH7.menu.pnum.GENERIC_H743IGKX=Generic H743IGKx
GenH7.menu.pnum.GENERIC_H743IGKX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H743IGKX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743IGKX.build.board=GENERIC_H743IGKX
GenH7.menu.pnum.GENERIC_H743IGKX.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743IGKX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)

# Generic H743IGTx
GenH7.menu.pnum.GENERIC_H743IGTX=Generic H743IGTx
GenH7.menu.pnum.GENERIC_H743IGTX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H743IGTX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743IGTX.build.board=GENERIC_H743IGTX
GenH7.menu.pnum.GENERIC_H743IGTX.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743IGTX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)

# Generic H743IIKx
GenH7.menu.pnum.GENERIC_H743IIKX=Generic H743IIKx
GenH7.menu.pnum.GENERIC_H743IIKX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H743IIKX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743IIKX.build.board=GENERIC_H743IIKX
GenH7.menu.pnum.GENERIC_H743IIKX.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743IIKX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)

# Generic H743IITx
GenH7.menu.pnum.GENERIC_H743IITX=Generic H743IITx
GenH7.menu.pnum.GENERIC_H743IITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H743IITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743IITX.build.board=GENERIC_H743IITX
GenH7.menu.pnum.GENERIC_H743IITX.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743IITX.build.variant=STM32H7xx/H742I(G-I)(K-T)_H743I(G-I)(K-T)_H750IB(K-T)_H753II(K-T)

# Generic H743VGHx
GenH7.menu.pnum.GENERIC_H743VGHX=Generic H743VGHx
GenH7.menu.pnum.GENERIC_H743VGHX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H743VGHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743VGHX.build.board=GENERIC_H743VGHX
GenH7.menu.pnum.GENERIC_H743VGHX.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743VGHX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)

# Generic H743VIHx
GenH7.menu.pnum.GENERIC_H743VIHX=Generic H743VIHx
GenH7.menu.pnum.GENERIC_H743VIHX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H743VIHX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743VIHX.build.board=GENERIC_H743VIHX
GenH7.menu.pnum.GENERIC_H743VIHX.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743VIHX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)

# Generic H743VGTx
GenH7.menu.pnum.GENERIC_H743VGTX=Generic H743VGTx
GenH7.menu.pnum.GENERIC_H743VGTX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H743VGTX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743VGTX.build.board=GENERIC_H743VGTX
GenH7.menu.pnum.GENERIC_H743VGTX.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743VGTX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)

# Generic H743VITx
GenH7.menu.pnum.GENERIC_H743VITX=Generic H743VITx
GenH7.menu.pnum.GENERIC_H743VITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H743VITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743VITX.build.board=GENERIC_H743VITX
GenH7.menu.pnum.GENERIC_H743VITX.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743VITX.build.variant=STM32H7xx/H742V(G-I)(H-T)_H743V(G-I)(H-T)_H750VBT_H753VI(H-T)

# Generic H743ZGTx
GenH7.menu.pnum.GENERIC_H743ZGTX=Generic H743ZGTx
GenH7.menu.pnum.GENERIC_H743ZGTX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H743ZGTX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743ZGTX.build.board=GENERIC_H743ZGTX
GenH7.menu.pnum.GENERIC_H743ZGTX.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743ZGTX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Generic H743ZITx
GenH7.menu.pnum.GENERIC_H743ZITX=Generic H743ZITx
GenH7.menu.pnum.GENERIC_H743ZITX.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H743ZITX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743ZITX.build.board=GENERIC_H743ZITX
GenH7.menu.pnum.GENERIC_H743ZITX.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743ZITX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

# Generic H747AGIx
GenH7.menu.pnum.GENERIC_H747AGIX=Generic H747AGIx
GenH7.menu.pnum.GENERIC_H747AGIX.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H747AGIX.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H747AGIX.build.board=GENERIC_H747AGIX
GenH7.menu.pnum.GENERIC_H747AGIX.build.product_line=STM32H747xx
GenH7.menu.pnum.GENERIC_H747AGIX.build.variant=STM32H7xx/H742Z(G-I)T_H743Z(G-I)T_H747A(G-I)I_H747I(G-I)T_H750ZBT_H753ZIT_H757AII_H757IIT

