stm32duino/Arduino_Core_STM32/boards.txt
# Generic L433CBUx
GenL4.menu.pnum.GENERIC_L433CBUX=Generic L433CBUx
GenL4.menu.pnum.GENERIC_L433CBUX.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L433CBUX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L433CBUX.build.board=GENERIC_L433CBUX
GenL4.menu.pnum.GENERIC_L433CBUX.build.product_line=STM32L433xx
GenL4.menu.pnum.GENERIC_L433CBUX.build.variant=STM32L4xx/L433C(B-C)(T-U)_L443CC(T-U)

# Generic L433CCUx
GenL4.menu.pnum.GENERIC_L433CCUX=Generic L433CCUx
GenL4.menu.pnum.GENERIC_L433CCUX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L433CCUX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L433CCUX.build.board=GENERIC_L433CCUX
GenL4.menu.pnum.GENERIC_L433CCUX.build.product_line=STM32L433xx
GenL4.menu.pnum.GENERIC_L433CCUX.build.variant=STM32L4xx/L433C(B-C)(T-U)_L443CC(T-U)

# Generic L433RCTxP
GenL4.menu.pnum.GENERIC_L433RCTXP=Generic L433RCTxP
GenL4.menu.pnum.GENERIC_L433RCTXP.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L433RCTXP.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L433RCTXP.build.board=GENERIC_L433RCTXP
GenL4.menu.pnum.GENERIC_L433RCTXP.build.product_line=STM32L433xx
GenL4.menu.pnum.GENERIC_L433RCTXP.build.variant=STM32L4xx/L433RCTxP

# Generic L443CCTx
GenL4.menu.pnum.GENERIC_L443CCTX=Generic L443CCTx
GenL4.menu.pnum.GENERIC_L443CCTX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L443CCTX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L443CCTX.build.board=GENERIC_L443CCTX
GenL4.menu.pnum.GENERIC_L443CCTX.build.product_line=STM32L443xx
GenL4.menu.pnum.GENERIC_L443CCTX.build.variant=STM32L4xx/L433C(B-C)(T-U)_L443CC(T-U)

# Generic L443CCUx
GenL4.menu.pnum.GENERIC_L443CCUX=Generic L443CCUx
GenL4.menu.pnum.GENERIC_L443CCUX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L443CCUX.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L443CCUX.build.board=GENERIC_L443CCUX
GenL4.menu.pnum.GENERIC_L443CCUX.build.product_line=STM32L443xx
GenL4.menu.pnum.GENERIC_L443CCUX.build.variant=STM32L4xx/L433C(B-C)(T-U)_L443CC(T-U)

# Generic L452RCIx
GenL4.menu.pnum.GENERIC_L452RCIX=Generic L452RCIx
GenL4.menu.pnum.GENERIC_L452RCIX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L452RCIX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L452RCIX.build.board=GENERIC_L452RCIX
GenL4.menu.pnum.GENERIC_L452RCIX.build.product_line=STM32L452xx
GenL4.menu.pnum.GENERIC_L452RCIX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)

# Generic L452REIx
GenL4.menu.pnum.GENERIC_L452REIX=Generic L452REIx
GenL4.menu.pnum.GENERIC_L452REIX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L452REIX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L452REIX.build.board=GENERIC_L452REIX
GenL4.menu.pnum.GENERIC_L452REIX.build.product_line=STM32L452xx
GenL4.menu.pnum.GENERIC_L452REIX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)

# Generic L452RCTx
GenL4.menu.pnum.GENERIC_L452RCTX=Generic L452RCTx
GenL4.menu.pnum.GENERIC_L452RCTX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L452RCTX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L452RCTX.build.board=GENERIC_L452RCTX
GenL4.menu.pnum.GENERIC_L452RCTX.build.product_line=STM32L452xx
GenL4.menu.pnum.GENERIC_L452RCTX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)

# Generic L452RETx
GenL4.menu.pnum.GENERIC_L452RETX=Generic L452RETx
GenL4.menu.pnum.GENERIC_L452RETX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L452RETX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L452RETX.build.board=GENERIC_L452RETX
GenL4.menu.pnum.GENERIC_L452RETX.build.product_line=STM32L452xx
GenL4.menu.pnum.GENERIC_L452RETX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)

# Generic L452RCYx
GenL4.menu.pnum.GENERIC_L452RCYX=Generic L452RCYx
GenL4.menu.pnum.GENERIC_L452RCYX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L452RCYX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L452RCYX.build.board=GENERIC_L452RCYX
GenL4.menu.pnum.GENERIC_L452RCYX.build.product_line=STM32L452xx
GenL4.menu.pnum.GENERIC_L452RCYX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)

# Generic L452REYx
GenL4.menu.pnum.GENERIC_L452REYX=Generic L452REYx
GenL4.menu.pnum.GENERIC_L452REYX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L452REYX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L452REYX.build.board=GENERIC_L452REYX
GenL4.menu.pnum.GENERIC_L452REYX.build.product_line=STM32L452xx
GenL4.menu.pnum.GENERIC_L452REYX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)

# Generic L452RETxP
GenL4.menu.pnum.GENERIC_L452RETXP=Generic L452RETxP
GenL4.menu.pnum.GENERIC_L452RETXP.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L452RETXP.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L452RETXP.build.board=GENERIC_L452RETXP
GenL4.menu.pnum.GENERIC_L452RETXP.build.product_line=STM32L452xx
GenL4.menu.pnum.GENERIC_L452RETXP.build.variant=STM32L4xx/L452RETxP

# Generic L462REIx
GenL4.menu.pnum.GENERIC_L462REIX=Generic L462REIx
GenL4.menu.pnum.GENERIC_L462REIX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L462REIX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L462REIX.build.board=GENERIC_L462REIX
GenL4.menu.pnum.GENERIC_L462REIX.build.product_line=STM32L462xx
GenL4.menu.pnum.GENERIC_L462REIX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)

# Generic L462RETx
GenL4.menu.pnum.GENERIC_L462RETX=Generic L462RETx
GenL4.menu.pnum.GENERIC_L462RETX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L462RETX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L462RETX.build.board=GENERIC_L462RETX
GenL4.menu.pnum.GENERIC_L462RETX.build.product_line=STM32L462xx
GenL4.menu.pnum.GENERIC_L462RETX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)

# Generic L462REYx
GenL4.menu.pnum.GENERIC_L462REYX=Generic L462REYx
GenL4.menu.pnum.GENERIC_L462REYX.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L462REYX.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L462REYX.build.board=GENERIC_L462REYX
GenL4.menu.pnum.GENERIC_L462REYX.build.product_line=STM32L462xx
GenL4.menu.pnum.GENERIC_L462REYX.build.variant=STM32L4xx/L452RC(I-T-Y)_L452RE(I-T-Y)x(P)_L462RE(I-T-Y)

# Generic L475RCTx
GenL4.menu.pnum.GENERIC_L475RCTX=Generic L475RCTx
GenL4.menu.pnum.GENERIC_L475RCTX.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L475RCTX.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L475RCTX.build.board=GENERIC_L475RCTX
GenL4.menu.pnum.GENERIC_L475RCTX.build.product_line=STM32L475xx
GenL4.menu.pnum.GENERIC_L475RCTX.build.variant=STM32L4xx/L475R(C-E-G)T_L476R(C-E-G)T_L486RGT

