stm32duino/Arduino_Core_STM32/boards.txt
# Generic L496ZGTxP
GenL4.menu.pnum.GENERIC_L496ZGTXP=Generic L496ZGTxP
GenL4.menu.pnum.GENERIC_L496ZGTXP.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L496ZGTXP.upload.maximum_data_size=327680
GenL4.menu.pnum.GENERIC_L496ZGTXP.build.board=GENERIC_L496ZGTXP
GenL4.menu.pnum.GENERIC_L496ZGTXP.build.product_line=STM32L496xx
GenL4.menu.pnum.GENERIC_L496ZGTXP.build.variant=STM32L4xx/L496ZGTxP_L4A6ZGTxP

# Generic L4A6ZGTx
GenL4.menu.pnum.GENERIC_L4A6ZGTX=Generic L4A6ZGTx
GenL4.menu.pnum.GENERIC_L4A6ZGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4A6ZGTX.upload.maximum_data_size=327680
GenL4.menu.pnum.GENERIC_L4A6ZGTX.build.board=GENERIC_L4A6ZGTX
GenL4.menu.pnum.GENERIC_L4A6ZGTX.build.product_line=STM32L4A6xx
GenL4.menu.pnum.GENERIC_L4A6ZGTX.build.variant=STM32L4xx/L496Z(E-G)T_L4A6ZGT

# Generic L4A6ZGTxP
GenL4.menu.pnum.GENERIC_L4A6ZGTXP=Generic L4A6ZGTxP
GenL4.menu.pnum.GENERIC_L4A6ZGTXP.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4A6ZGTXP.upload.maximum_data_size=327680
GenL4.menu.pnum.GENERIC_L4A6ZGTXP.build.board=GENERIC_L4A6ZGTXP
GenL4.menu.pnum.GENERIC_L4A6ZGTXP.build.product_line=STM32L4A6xx
GenL4.menu.pnum.GENERIC_L4A6ZGTXP.build.variant=STM32L4xx/L496ZGTxP_L4A6ZGTxP

# Generic L4R5VGTx
GenL4.menu.pnum.GENERIC_L4R5VGTX=Generic L4R5VGTx
GenL4.menu.pnum.GENERIC_L4R5VGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4R5VGTX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5VGTX.build.board=GENERIC_L4R5VGTX
GenL4.menu.pnum.GENERIC_L4R5VGTX.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5VGTX.build.variant=STM32L4xx/L4R5V(G-I)T_L4R7VIT_L4S5VIT_L4S7VIT

# Generic L4R5VITx
GenL4.menu.pnum.GENERIC_L4R5VITX=Generic L4R5VITx
GenL4.menu.pnum.GENERIC_L4R5VITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R5VITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5VITX.build.board=GENERIC_L4R5VITX
GenL4.menu.pnum.GENERIC_L4R5VITX.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5VITX.build.variant=STM32L4xx/L4R5V(G-I)T_L4R7VIT_L4S5VIT_L4S7VIT

# Generic L4R5ZGTx
GenL4.menu.pnum.GENERIC_L4R5ZGTX=Generic L4R5ZGTx
GenL4.menu.pnum.GENERIC_L4R5ZGTX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4R5ZGTX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5ZGTX.build.board=GENERIC_L4R5ZGTX
GenL4.menu.pnum.GENERIC_L4R5ZGTX.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5ZGTX.build.variant=STM32L4xx/L4R5Z(G-I)T_L4R7ZIT_L4S5ZIT_L4S7ZIT

# Generic L4R5ZGYx
GenL4.menu.pnum.GENERIC_L4R5ZGYX=Generic L4R5ZGYx
GenL4.menu.pnum.GENERIC_L4R5ZGYX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4R5ZGYX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5ZGYX.build.board=GENERIC_L4R5ZGYX
GenL4.menu.pnum.GENERIC_L4R5ZGYX.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5ZGYX.build.variant=STM32L4xx/L4R5Z(G-I)Y_L4R9Z(G-I)Y_L4S5ZIY_L4S9ZIY

# Generic L4R5ZITx
GenL4.menu.pnum.GENERIC_L4R5ZITX=Generic L4R5ZITx
GenL4.menu.pnum.GENERIC_L4R5ZITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R5ZITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5ZITX.build.board=GENERIC_L4R5ZITX
GenL4.menu.pnum.GENERIC_L4R5ZITX.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5ZITX.build.variant=STM32L4xx/L4R5Z(G-I)T_L4R7ZIT_L4S5ZIT_L4S7ZIT

# Generic L4R5ZIYx
GenL4.menu.pnum.GENERIC_L4R5ZIYX=Generic L4R5ZIYx
GenL4.menu.pnum.GENERIC_L4R5ZIYX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R5ZIYX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5ZIYX.build.board=GENERIC_L4R5ZIYX
GenL4.menu.pnum.GENERIC_L4R5ZIYX.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5ZIYX.build.variant=STM32L4xx/L4R5Z(G-I)Y_L4R9Z(G-I)Y_L4S5ZIY_L4S9ZIY

# Generic L4R5ZITxP
GenL4.menu.pnum.GENERIC_L4R5ZITXP=Generic L4R5ZITxP
GenL4.menu.pnum.GENERIC_L4R5ZITXP.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R5ZITXP.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5ZITXP.build.board=GENERIC_L4R5ZITXP
GenL4.menu.pnum.GENERIC_L4R5ZITXP.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5ZITXP.build.variant=STM32L4xx/L4R5ZITxP

# Generic L4R7VITx
GenL4.menu.pnum.GENERIC_L4R7VITX=Generic L4R7VITx
GenL4.menu.pnum.GENERIC_L4R7VITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R7VITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R7VITX.build.board=GENERIC_L4R7VITX
GenL4.menu.pnum.GENERIC_L4R7VITX.build.product_line=STM32L4R7xx
GenL4.menu.pnum.GENERIC_L4R7VITX.build.variant=STM32L4xx/L4R5V(G-I)T_L4R7VIT_L4S5VIT_L4S7VIT

# Generic L4R7ZITx
GenL4.menu.pnum.GENERIC_L4R7ZITX=Generic L4R7ZITx
GenL4.menu.pnum.GENERIC_L4R7ZITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R7ZITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R7ZITX.build.board=GENERIC_L4R7ZITX
GenL4.menu.pnum.GENERIC_L4R7ZITX.build.product_line=STM32L4R7xx
GenL4.menu.pnum.GENERIC_L4R7ZITX.build.variant=STM32L4xx/L4R5Z(G-I)T_L4R7ZIT_L4S5ZIT_L4S7ZIT

# Generic L4R9ZGJx
GenL4.menu.pnum.GENERIC_L4R9ZGJX=Generic L4R9ZGJx
GenL4.menu.pnum.GENERIC_L4R9ZGJX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4R9ZGJX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R9ZGJX.build.board=GENERIC_L4R9ZGJX
GenL4.menu.pnum.GENERIC_L4R9ZGJX.build.product_line=STM32L4R9xx
GenL4.menu.pnum.GENERIC_L4R9ZGJX.build.variant=STM32L4xx/L4R9Z(G-I)J_L4S9ZIJ

# Generic L4R9ZGYx
GenL4.menu.pnum.GENERIC_L4R9ZGYX=Generic L4R9ZGYx
GenL4.menu.pnum.GENERIC_L4R9ZGYX.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4R9ZGYX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R9ZGYX.build.board=GENERIC_L4R9ZGYX
GenL4.menu.pnum.GENERIC_L4R9ZGYX.build.product_line=STM32L4R9xx
GenL4.menu.pnum.GENERIC_L4R9ZGYX.build.variant=STM32L4xx/L4R5Z(G-I)Y_L4R9Z(G-I)Y_L4S5ZIY_L4S9ZIY

# Generic L4R9ZIJx
GenL4.menu.pnum.GENERIC_L4R9ZIJX=Generic L4R9ZIJx
GenL4.menu.pnum.GENERIC_L4R9ZIJX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R9ZIJX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R9ZIJX.build.board=GENERIC_L4R9ZIJX
GenL4.menu.pnum.GENERIC_L4R9ZIJX.build.product_line=STM32L4R9xx
GenL4.menu.pnum.GENERIC_L4R9ZIJX.build.variant=STM32L4xx/L4R9Z(G-I)J_L4S9ZIJ

# Generic L4R9ZIYx
GenL4.menu.pnum.GENERIC_L4R9ZIYX=Generic L4R9ZIYx
GenL4.menu.pnum.GENERIC_L4R9ZIYX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R9ZIYX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R9ZIYX.build.board=GENERIC_L4R9ZIYX
GenL4.menu.pnum.GENERIC_L4R9ZIYX.build.product_line=STM32L4R9xx
GenL4.menu.pnum.GENERIC_L4R9ZIYX.build.variant=STM32L4xx/L4R5Z(G-I)Y_L4R9Z(G-I)Y_L4S5ZIY_L4S9ZIY

# Generic L4S5VITx
GenL4.menu.pnum.GENERIC_L4S5VITX=Generic L4S5VITx
GenL4.menu.pnum.GENERIC_L4S5VITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S5VITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S5VITX.build.board=GENERIC_L4S5VITX
GenL4.menu.pnum.GENERIC_L4S5VITX.build.product_line=STM32L4S5xx
GenL4.menu.pnum.GENERIC_L4S5VITX.build.variant=STM32L4xx/L4R5V(G-I)T_L4R7VIT_L4S5VIT_L4S7VIT

# Generic L4S5ZITx
GenL4.menu.pnum.GENERIC_L4S5ZITX=Generic L4S5ZITx
GenL4.menu.pnum.GENERIC_L4S5ZITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S5ZITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S5ZITX.build.board=GENERIC_L4S5ZITX
GenL4.menu.pnum.GENERIC_L4S5ZITX.build.product_line=STM32L4S5xx
GenL4.menu.pnum.GENERIC_L4S5ZITX.build.variant=STM32L4xx/L4R5Z(G-I)T_L4R7ZIT_L4S5ZIT_L4S7ZIT

# Generic L4S5ZIYx
GenL4.menu.pnum.GENERIC_L4S5ZIYX=Generic L4S5ZIYx
GenL4.menu.pnum.GENERIC_L4S5ZIYX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S5ZIYX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S5ZIYX.build.board=GENERIC_L4S5ZIYX
GenL4.menu.pnum.GENERIC_L4S5ZIYX.build.product_line=STM32L4S5xx
GenL4.menu.pnum.GENERIC_L4S5ZIYX.build.variant=STM32L4xx/L4R5Z(G-I)Y_L4R9Z(G-I)Y_L4S5ZIY_L4S9ZIY

# Generic L4S7VITx
GenL4.menu.pnum.GENERIC_L4S7VITX=Generic L4S7VITx
GenL4.menu.pnum.GENERIC_L4S7VITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S7VITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S7VITX.build.board=GENERIC_L4S7VITX
GenL4.menu.pnum.GENERIC_L4S7VITX.build.product_line=STM32L4S7xx
GenL4.menu.pnum.GENERIC_L4S7VITX.build.variant=STM32L4xx/L4R5V(G-I)T_L4R7VIT_L4S5VIT_L4S7VIT

# Generic L4S7ZITx
GenL4.menu.pnum.GENERIC_L4S7ZITX=Generic L4S7ZITx
GenL4.menu.pnum.GENERIC_L4S7ZITX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S7ZITX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S7ZITX.build.board=GENERIC_L4S7ZITX
GenL4.menu.pnum.GENERIC_L4S7ZITX.build.product_line=STM32L4S7xx
GenL4.menu.pnum.GENERIC_L4S7ZITX.build.variant=STM32L4xx/L4R5Z(G-I)T_L4R7ZIT_L4S5ZIT_L4S7ZIT

# Generic L4S9ZIJx
GenL4.menu.pnum.GENERIC_L4S9ZIJX=Generic L4S9ZIJx
GenL4.menu.pnum.GENERIC_L4S9ZIJX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S9ZIJX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S9ZIJX.build.board=GENERIC_L4S9ZIJX
GenL4.menu.pnum.GENERIC_L4S9ZIJX.build.product_line=STM32L4S9xx
GenL4.menu.pnum.GENERIC_L4S9ZIJX.build.variant=STM32L4xx/L4R9Z(G-I)J_L4S9ZIJ

# Generic L4S9ZIYx
GenL4.menu.pnum.GENERIC_L4S9ZIYX=Generic L4S9ZIYx
GenL4.menu.pnum.GENERIC_L4S9ZIYX.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S9ZIYX.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S9ZIYX.build.board=GENERIC_L4S9ZIYX
GenL4.menu.pnum.GENERIC_L4S9ZIYX.build.product_line=STM32L4S9xx
GenL4.menu.pnum.GENERIC_L4S9ZIYX.build.variant=STM32L4xx/L4R5Z(G-I)Y_L4R9Z(G-I)Y_L4S5ZIY_L4S9ZIY

# Upload menu
GenL4.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenL4.menu.upload_method.swdMethod.upload.protocol=0
GenL4.menu.upload_method.swdMethod.upload.options=-g
GenL4.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenL4.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenL4.menu.upload_method.serialMethod.upload.protocol=1
GenL4.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenL4.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenL4.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenL4.menu.upload_method.dfuMethod.upload.protocol=2
GenL4.menu.upload_method.dfuMethod.upload.options=-g
GenL4.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic L5
GenL5.name=Generic STM32L5 series

