stm32duino/Arduino_Core_STM32/boards.txt
# Generic WLE4J8Ix
GenWL.menu.pnum.GENERIC_WLE4J8IX=Generic WLE4J8Ix
GenWL.menu.pnum.GENERIC_WLE4J8IX.upload.maximum_size=65536
GenWL.menu.pnum.GENERIC_WLE4J8IX.upload.maximum_data_size=20480
GenWL.menu.pnum.GENERIC_WLE4J8IX.build.board=GENERIC_WLE4J8IX
GenWL.menu.pnum.GENERIC_WLE4J8IX.build.product_line=STM32WLE4xx
GenWL.menu.pnum.GENERIC_WLE4J8IX.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I

# Generic WLE4JBIx
GenWL.menu.pnum.GENERIC_WLE4JBIX=Generic WLE4JBIx
GenWL.menu.pnum.GENERIC_WLE4JBIX.upload.maximum_size=131072
GenWL.menu.pnum.GENERIC_WLE4JBIX.upload.maximum_data_size=49152
GenWL.menu.pnum.GENERIC_WLE4JBIX.build.board=GENERIC_WLE4JBIX
GenWL.menu.pnum.GENERIC_WLE4JBIX.build.product_line=STM32WLE4xx
GenWL.menu.pnum.GENERIC_WLE4JBIX.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I

# Generic WLE4JCIx
GenWL.menu.pnum.GENERIC_WLE4JCIX=Generic WLE4JCIx
GenWL.menu.pnum.GENERIC_WLE4JCIX.upload.maximum_size=262144
GenWL.menu.pnum.GENERIC_WLE4JCIX.upload.maximum_data_size=65536
GenWL.menu.pnum.GENERIC_WLE4JCIX.build.board=GENERIC_WLE4JCIX
GenWL.menu.pnum.GENERIC_WLE4JCIX.build.product_line=STM32WLE4xx
GenWL.menu.pnum.GENERIC_WLE4JCIX.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I

# Generic WLE5C8Ux
GenWL.menu.pnum.GENERIC_WLE5C8UX=Generic WLE5C8Ux
GenWL.menu.pnum.GENERIC_WLE5C8UX.upload.maximum_size=65536
GenWL.menu.pnum.GENERIC_WLE5C8UX.upload.maximum_data_size=20480
GenWL.menu.pnum.GENERIC_WLE5C8UX.build.board=GENERIC_WLE5C8UX
GenWL.menu.pnum.GENERIC_WLE5C8UX.build.product_line=STM32WLE5xx
GenWL.menu.pnum.GENERIC_WLE5C8UX.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U

# Generic WLE5CBUx
GenWL.menu.pnum.GENERIC_WLE5CBUX=Generic WLE5CBUx
GenWL.menu.pnum.GENERIC_WLE5CBUX.upload.maximum_size=131072
GenWL.menu.pnum.GENERIC_WLE5CBUX.upload.maximum_data_size=49152
GenWL.menu.pnum.GENERIC_WLE5CBUX.build.board=GENERIC_WLE5CBUX
GenWL.menu.pnum.GENERIC_WLE5CBUX.build.product_line=STM32WLE5xx
GenWL.menu.pnum.GENERIC_WLE5CBUX.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U

# Generic WLE5CCUx
GenWL.menu.pnum.GENERIC_WLE5CCUX=Generic WLE5CCUx
GenWL.menu.pnum.GENERIC_WLE5CCUX.upload.maximum_size=262144
GenWL.menu.pnum.GENERIC_WLE5CCUX.upload.maximum_data_size=65536
GenWL.menu.pnum.GENERIC_WLE5CCUX.build.board=GENERIC_WLE5CCUX
GenWL.menu.pnum.GENERIC_WLE5CCUX.build.product_line=STM32WLE5xx
GenWL.menu.pnum.GENERIC_WLE5CCUX.build.variant=STM32WLxx/WL54CCU_WL55CCU_WLE4C(8-B-C)U_WLE5C(8-B-C)U

# Generic WLE5J8Ix
GenWL.menu.pnum.GENERIC_WLE5J8IX=Generic WLE5J8Ix
GenWL.menu.pnum.GENERIC_WLE5J8IX.upload.maximum_size=65536
GenWL.menu.pnum.GENERIC_WLE5J8IX.upload.maximum_data_size=20480
GenWL.menu.pnum.GENERIC_WLE5J8IX.build.board=GENERIC_WLE5J8IX
GenWL.menu.pnum.GENERIC_WLE5J8IX.build.product_line=STM32WLE5xx
GenWL.menu.pnum.GENERIC_WLE5J8IX.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I

# Generic WLE5JBIx
GenWL.menu.pnum.GENERIC_WLE5JBIX=Generic WLE5JBIx
GenWL.menu.pnum.GENERIC_WLE5JBIX.upload.maximum_size=131072
GenWL.menu.pnum.GENERIC_WLE5JBIX.upload.maximum_data_size=49152
GenWL.menu.pnum.GENERIC_WLE5JBIX.build.board=GENERIC_WLE5JBIX
GenWL.menu.pnum.GENERIC_WLE5JBIX.build.product_line=STM32WLE5xx
GenWL.menu.pnum.GENERIC_WLE5JBIX.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I

# Generic WLE5JCIx
GenWL.menu.pnum.GENERIC_WLE5JCIX=Generic WLE5JCIx
GenWL.menu.pnum.GENERIC_WLE5JCIX.upload.maximum_size=262144
GenWL.menu.pnum.GENERIC_WLE5JCIX.upload.maximum_data_size=65536
GenWL.menu.pnum.GENERIC_WLE5JCIX.build.board=GENERIC_WLE5JCIX
GenWL.menu.pnum.GENERIC_WLE5JCIX.build.product_line=STM32WLE5xx
GenWL.menu.pnum.GENERIC_WLE5JCIX.build.variant=STM32WLxx/WL54JCI_WL55JCI_WLE4J(8-B-C)I_WLE5J(8-B-C)I

# Upload menu
GenWL.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenWL.menu.upload_method.swdMethod.upload.protocol=0
GenWL.menu.upload_method.swdMethod.upload.options=-g
GenWL.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenWL.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenWL.menu.upload_method.serialMethod.upload.protocol=1
GenWL.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenWL.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenWL.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenWL.menu.upload_method.dfuMethod.upload.protocol=2
GenWL.menu.upload_method.dfuMethod.upload.options=-g
GenWL.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# 3D printer boards

3dprinter.name=3D printer boards

3dprinter.build.core=arduino
3dprinter.build.board=3dprinter
3dprinter.build.variant_h=variant_{build.board}.h
3dprinter.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# ARMED_V1 board
3dprinter.menu.pnum.ARMED_V1=Armed V1
3dprinter.menu.pnum.ARMED_V1.upload.maximum_size=524288
3dprinter.menu.pnum.ARMED_V1.upload.maximum_data_size=131072
3dprinter.menu.pnum.ARMED_V1.build.mcu=cortex-m4
3dprinter.menu.pnum.ARMED_V1.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
3dprinter.menu.pnum.ARMED_V1.build.board=ARMED_V1
3dprinter.menu.pnum.ARMED_V1.build.series=STM32F4xx
3dprinter.menu.pnum.ARMED_V1.build.product_line=STM32F407xx
3dprinter.menu.pnum.ARMED_V1.build.variant=STM32F4xx/F407V(E-G)T_F417V(E-G)T
3dprinter.menu.pnum.ARMED_V1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
3dprinter.menu.pnum.ARMED_V1.build.cmsis_lib_gcc=arm_cortexM4lf_math

# REMRAM_V1 board
3dprinter.menu.pnum.REMRAM_V1=RemRam v1
3dprinter.menu.pnum.REMRAM_V1.upload.maximum_size=2097152
3dprinter.menu.pnum.REMRAM_V1.upload.maximum_data_size=524288
3dprinter.menu.pnum.REMRAM_V1.build.mcu=cortex-m7
3dprinter.menu.pnum.REMRAM_V1.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
3dprinter.menu.pnum.REMRAM_V1.build.board=REMRAM_V1
3dprinter.menu.pnum.REMRAM_V1.build.series=STM32F7xx
3dprinter.menu.pnum.REMRAM_V1.build.product_line=STM32F765xx
3dprinter.menu.pnum.REMRAM_V1.build.variant=STM32F7xx/F765V(G-I)(H-T)_F767V(G-I)(H-T)_F777VI(H-T)
3dprinter.menu.pnum.REMRAM_V1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
3dprinter.menu.pnum.REMRAM_V1.build.cmsis_lib_gcc=arm_cortexM7lfsp_math

# RUMBA32 board
3dprinter.menu.pnum.RUMBA32=RUMBA32
3dprinter.menu.pnum.RUMBA32.upload.maximum_size=524288
3dprinter.menu.pnum.RUMBA32.upload.maximum_data_size=131072
3dprinter.menu.pnum.RUMBA32.build.mcu=cortex-m4
3dprinter.menu.pnum.RUMBA32.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
3dprinter.menu.pnum.RUMBA32.build.board=RUMBA32
3dprinter.menu.pnum.RUMBA32.build.series=STM32F4xx
3dprinter.menu.pnum.RUMBA32.build.product_line=STM32F446xx
3dprinter.menu.pnum.RUMBA32.build.variant=STM32F4xx/F446V(C-E)T
3dprinter.menu.pnum.RUMBA32.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
3dprinter.menu.pnum.RUMBA32.build.cmsis_lib_gcc=arm_cortexM4lf_math

# STEVAL-3DP001V1 board
3dprinter.menu.pnum.ST3DP001_EVAL=STEVAL-3DP001V1
3dprinter.menu.pnum.ST3DP001_EVAL.upload.maximum_size=524288
3dprinter.menu.pnum.ST3DP001_EVAL.upload.maximum_data_size=98304
3dprinter.menu.pnum.ST3DP001_EVAL.build.mcu=cortex-m4
3dprinter.menu.pnum.ST3DP001_EVAL.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
3dprinter.menu.pnum.ST3DP001_EVAL.build.board=ST3DP001_EVAL
3dprinter.menu.pnum.ST3DP001_EVAL.build.series=STM32F4xx
3dprinter.menu.pnum.ST3DP001_EVAL.build.product_line=STM32F401xE
3dprinter.menu.pnum.ST3DP001_EVAL.build.variant=STM32F4xx/F401V(B-C-D-E)T
3dprinter.menu.pnum.ST3DP001_EVAL.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
3dprinter.menu.pnum.ST3DP001_EVAL.build.cmsis_lib_gcc=arm_cortexM4lf_math

# PRNTR_V1 board
3dprinter.menu.pnum.PRNTR_V1=PRNTR v1
3dprinter.menu.pnum.PRNTR_V1.upload.maximum_size=524288
3dprinter.menu.pnum.PRNTR_V1.upload.maximum_data_size=131072
3dprinter.menu.pnum.PRNTR_V1.build.mcu=cortex-m4
3dprinter.menu.pnum.PRNTR_V1.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
3dprinter.menu.pnum.PRNTR_V1.build.board=PRNTR_V1
3dprinter.menu.pnum.PRNTR_V1.build.series=STM32F4xx
3dprinter.menu.pnum.PRNTR_V1.build.product_line=STM32F407xx
3dprinter.menu.pnum.PRNTR_V1.build.variant=STM32F4xx/F407V(E-G)T_F417V(E-G)T
3dprinter.menu.pnum.PRNTR_V1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
3dprinter.menu.pnum.PRNTR_V1.build.cmsis_lib_gcc=arm_cortexM4lf_math

# PRNTR_V2 board
3dprinter.menu.pnum.PRNTR_V2=PRNTR v2
3dprinter.menu.pnum.PRNTR_V2.upload.maximum_size=524288
3dprinter.menu.pnum.PRNTR_V2.upload.maximum_data_size=131072
3dprinter.menu.pnum.PRNTR_V2.build.mcu=cortex-m4
3dprinter.menu.pnum.PRNTR_V2.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
3dprinter.menu.pnum.PRNTR_V2.build.board=PRNTR_V2
3dprinter.menu.pnum.PRNTR_V2.build.series=STM32F4xx
3dprinter.menu.pnum.PRNTR_V2.build.product_line=STM32F407xx
3dprinter.menu.pnum.PRNTR_V2.build.variant=STM32F4xx/F407V(E-G)T_F417V(E-G)T
3dprinter.menu.pnum.PRNTR_V2.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
3dprinter.menu.pnum.PRNTR_V2.build.cmsis_lib_gcc=arm_cortexM4lf_math
3dprinter.menu.pnum.PRNTR_V2.build.flash_offset=0x8000
3dprinter.menu.pnum.PRNTR_V2.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -DVECT_TAB_OFFSET={build.flash_offset}

# EEXTR_F030_V1 board
3dprinter.menu.pnum.EEXTR_F030_V1=EExtruder F030 V1
3dprinter.menu.pnum.EEXTR_F030_V1.upload.maximum_size=65536
3dprinter.menu.pnum.EEXTR_F030_V1.upload.maximum_data_size=8192
3dprinter.menu.pnum.EEXTR_F030_V1.build.mcu=cortex-m0
3dprinter.menu.pnum.EEXTR_F030_V1.build.board=EEXTR_F030_V1
3dprinter.menu.pnum.EEXTR_F030_V1.build.series=STM32F0xx
3dprinter.menu.pnum.EEXTR_F030_V1.build.product_line=STM32F030x8
3dprinter.menu.pnum.EEXTR_F030_V1.build.variant=STM32F0xx/F030C8T
3dprinter.menu.pnum.EEXTR_F030_V1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
3dprinter.menu.pnum.EEXTR_F030_V1.build.cmsis_lib_gcc=arm_cortexM0l_math

