stm32duino/Arduino_Core_STM32/boards.txt
GenFlight.name=Generic Flight Controllers

GenFlight.build.core=arduino
GenFlight.build.board=Genericflight
GenFlight.build.variant_h=variant_{build.board}.h
GenFlight.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}

# AfroFlight Rev5
GenFlight.menu.pnum.AFROFLIGHT_F103CB=Afro Flight Rev5 (8MHz)
GenFlight.menu.pnum.AFROFLIGHT_F103CB.upload.maximum_size=131072
GenFlight.menu.pnum.AFROFLIGHT_F103CB.upload.maximum_data_size=20480
GenFlight.menu.pnum.AFROFLIGHT_F103CB.build.mcu=cortex-m3
GenFlight.menu.pnum.AFROFLIGHT_F103CB.build.series=STM32F1xx
GenFlight.menu.pnum.AFROFLIGHT_F103CB.build.cmsis_lib_gcc=arm_cortexM3l_math
GenFlight.menu.pnum.AFROFLIGHT_F103CB.build.board=AFROFLIGHT_F103CB
GenFlight.menu.pnum.AFROFLIGHT_F103CB.build.product_line=STM32F103xB
GenFlight.menu.pnum.AFROFLIGHT_F103CB.build.variant=STM32F1xx/F103C8T_F103CB(T-U)
GenFlight.menu.pnum.AFROFLIGHT_F103CB.build.variant_h=variant_AFROFLIGHT_F103CB_XX.h

GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M=Afro Flight Rev5 (12MHz)
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.upload.maximum_size=131072
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.upload.maximum_data_size=20480
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.build.mcu=cortex-m3
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.build.series=STM32F1xx
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.build.cmsis_lib_gcc=arm_cortexM3l_math
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.build.board=AFROFLIGHT_F103CB_12M
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.build.product_line=STM32F103xB
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.build.variant=STM32F1xx/F103C8T_F103CB(T-U)
GenFlight.menu.pnum.AFROFLIGHT_F103CB_12M.build.variant_h=variant_AFROFLIGHT_F103CB_XX.h

# Sparky_V1 board
GenFlight.menu.pnum.Sparky_V1=Sparky V1 F303 FC
GenFlight.menu.pnum.Sparky_V1.upload.maximum_size=262144
GenFlight.menu.pnum.Sparky_V1.upload.maximum_data_size=40960
GenFlight.menu.pnum.Sparky_V1.build.mcu=cortex-m4
GenFlight.menu.pnum.Sparky_V1.build.series=STM32F3xx
GenFlight.menu.pnum.Sparky_V1.build.cmsis_lib_gcc=arm_cortexM4lf_math
GenFlight.menu.pnum.Sparky_V1.build.board=SPARKY_F303CC
GenFlight.menu.pnum.Sparky_V1.build.product_line=STM32F303xC
GenFlight.menu.pnum.Sparky_V1.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
GenFlight.menu.pnum.Sparky_V1.build.variant=STM32F3xx/F303C(B-C)T
GenFlight.menu.pnum.Sparky_V1.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS

# Upload menu
GenFlight.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenFlight.menu.upload_method.swdMethod.upload.protocol=0
GenFlight.menu.upload_method.swdMethod.upload.options=-g
GenFlight.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenFlight.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenFlight.menu.upload_method.serialMethod.upload.protocol=1
GenFlight.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenFlight.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenFlight.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenFlight.menu.upload_method.dfuMethod.upload.protocol=2
GenFlight.menu.upload_method.dfuMethod.upload.options=-g
GenFlight.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenFlight.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenFlight.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenFlight.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenFlight.menu.upload_method.hidMethod=HID Bootloader 2.2
GenFlight.menu.upload_method.hidMethod.upload.protocol=hid22
GenFlight.menu.upload_method.hidMethod.upload.tool=hid_upload
GenFlight.menu.upload_method.hidMethod.build.flash_offset=0x800
GenFlight.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID -DVECT_TAB_OFFSET={build.flash_offset}

GenFlight.menu.upload_method.dfu2Method=Maple DFU Bootloader 2.0
GenFlight.menu.upload_method.dfu2Method.upload.protocol=maple
GenFlight.menu.upload_method.dfu2Method.upload.tool=maple_upload
GenFlight.menu.upload_method.dfu2Method.upload.usbID=1EAF:0003
GenFlight.menu.upload_method.dfu2Method.upload.altID=2
GenFlight.menu.upload_method.dfu2Method.build.flash_offset=0x2000
GenFlight.menu.upload_method.dfu2Method.build.bootloader_flags=-DBL_LEGACY_LEAF -DVECT_TAB_OFFSET={build.flash_offset}

GenFlight.menu.upload_method.dfuoMethod=Maple DFU Bootloader original
GenFlight.menu.upload_method.dfuoMethod.upload.protocol=maple
GenFlight.menu.upload_method.dfuoMethod.upload.tool=maple_upload
GenFlight.menu.upload_method.dfuoMethod.upload.usbID=1EAF:0003
GenFlight.menu.upload_method.dfuoMethod.upload.altID=1
GenFlight.menu.upload_method.dfuoMethod.build.flash_offset=0x5000
GenFlight.menu.upload_method.dfuoMethod.build.bootloader_flags=-DBL_LEGACY_LEAF -DVECT_TAB_OFFSET={build.flash_offset}

################################################################################
# LoRa boards

LoRa.name=LoRa boards
LoRa.build.core=arduino
LoRa.build.board=LoRa
LoRa.build.variant_h=variant_{build.board}.h
LoRa.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# RAK811_TRACKER board
LoRa.menu.pnum.RAK811_TRACKER=RAK811 LoRa Tracker (16kb RAM)
LoRa.menu.pnum.RAK811_TRACKER.upload.maximum_size=131072
LoRa.menu.pnum.RAK811_TRACKER.upload.maximum_data_size=16384
LoRa.menu.pnum.RAK811_TRACKER.build.mcu=cortex-m3
LoRa.menu.pnum.RAK811_TRACKER.build.board=RAK811_TRACKER
LoRa.menu.pnum.RAK811_TRACKER.build.series=STM32L1xx
LoRa.menu.pnum.RAK811_TRACKER.build.product_line=STM32L151xB
LoRa.menu.pnum.RAK811_TRACKER.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
LoRa.menu.pnum.RAK811_TRACKER.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
LoRa.menu.pnum.RAK811_TRACKER.build.cmsis_lib_gcc=arm_cortexM3l_math

LoRa.menu.pnum.RAK811_TRACKERA=RAK811 LoRa Tracker (32kb RAM)
LoRa.menu.pnum.RAK811_TRACKERA.upload.maximum_size=131072
LoRa.menu.pnum.RAK811_TRACKERA.upload.maximum_data_size=32768
LoRa.menu.pnum.RAK811_TRACKERA.build.mcu=cortex-m3
LoRa.menu.pnum.RAK811_TRACKERA.build.board=RAK811_TRACKERA
LoRa.menu.pnum.RAK811_TRACKERA.build.series=STM32L1xx
LoRa.menu.pnum.RAK811_TRACKERA.build.product_line=STM32L151xBA
LoRa.menu.pnum.RAK811_TRACKERA.build.variant=STM32L1xx/L100C6Ux(A)_L151C(6-8-B)(T-U)x(A)_L152C(6-8-B)(T-U)x(A)
LoRa.menu.pnum.RAK811_TRACKERA.build.variant_h=variant_RAK811_TRACKER.h
LoRa.menu.pnum.RAK811_TRACKERA.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
LoRa.menu.pnum.RAK811_TRACKERA.build.cmsis_lib_gcc=arm_cortexM3l_math

# RHF76_052 board
LoRa.menu.pnum.RHF76_052=RHF76 052
LoRa.menu.pnum.RHF76_052.upload.maximum_size=65536
LoRa.menu.pnum.RHF76_052.upload.maximum_data_size=8192
LoRa.menu.pnum.RHF76_052.build.mcu=cortex-m0plus
LoRa.menu.pnum.RHF76_052.build.board=RHF76_052
LoRa.menu.pnum.RHF76_052.build.series=STM32L0xx
LoRa.menu.pnum.RHF76_052.build.product_line=STM32L051xx
LoRa.menu.pnum.RHF76_052.build.variant=STM32L0xx/L051C(6-8)(T-U)
LoRa.menu.pnum.RHF76_052.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
LoRa.menu.pnum.RHF76_052.build.cmsis_lib_gcc=arm_cortexM0l_math
LoRa.menu.pnum.RHF76_052.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0

# ELEKTOR_F072C8
LoRa.menu.pnum.ELEKTOR_F072C8=Elektor LoRa Node Core F072C8 (64kB)
LoRa.menu.pnum.ELEKTOR_F072C8.upload.maximum_data_size=16384
LoRa.menu.pnum.ELEKTOR_F072C8.upload.maximum_size=65536
LoRa.menu.pnum.ELEKTOR_F072C8.build.mcu=cortex-m0
LoRa.menu.pnum.ELEKTOR_F072C8.build.board=ELEKTOR_F072C8
LoRa.menu.pnum.ELEKTOR_F072C8.build.series=STM32F0xx
LoRa.menu.pnum.ELEKTOR_F072C8.build.product_line=STM32F072xB
LoRa.menu.pnum.ELEKTOR_F072C8.build.variant=STM32F0xx/F072C8(T-U)_F072CB(T-U-Y)
LoRa.menu.pnum.ELEKTOR_F072C8.build.variant_h=variant_ELEKTOR_F072Cx.h
LoRa.menu.pnum.ELEKTOR_F072C8.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
LoRa.menu.pnum.ELEKTOR_F072C8.build.cmsis_lib_gcc=arm_cortexM0l_math
LoRa.menu.pnum.ELEKTOR_F072C8.build.extra_flags=-D{build.product_line} {build.xSerial}

# ELEKTOR_F072CB
LoRa.menu.pnum.ELEKTOR_F072CB=Elektor LoRa Node Core F072CB (128kB)
LoRa.menu.pnum.ELEKTOR_F072CB.upload.maximum_data_size=16384
LoRa.menu.pnum.ELEKTOR_F072CB.upload.maximum_size=131072
LoRa.menu.pnum.ELEKTOR_F072CB.build.mcu=cortex-m0
LoRa.menu.pnum.ELEKTOR_F072CB.build.board=ELEKTOR_F072CB
LoRa.menu.pnum.ELEKTOR_F072CB.build.series=STM32F0xx
LoRa.menu.pnum.ELEKTOR_F072CB.build.product_line=STM32F072xB
LoRa.menu.pnum.ELEKTOR_F072CB.build.variant=STM32F0xx/F072C8(T-U)_F072CB(T-U-Y)
LoRa.menu.pnum.ELEKTOR_F072CB.build.variant_h=variant_ELEKTOR_F072Cx.h
LoRa.menu.pnum.ELEKTOR_F072CB.build.peripheral_pins=-DCUSTOM_PERIPHERAL_PINS
LoRa.menu.pnum.ELEKTOR_F072CB.build.cmsis_lib_gcc=arm_cortexM0l_math
LoRa.menu.pnum.ELEKTOR_F072CB.build.extra_flags=-D{build.product_line} {build.xSerial}

# Upload menu
LoRa.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
LoRa.menu.upload_method.swdMethod.upload.protocol=0
LoRa.menu.upload_method.swdMethod.upload.options=-g
LoRa.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

