stm32duino/Arduino_Core_STM32/boards.txt
GenFlight.menu.opt.osstd=Smallest (-Os default)
GenFlight.menu.opt.oslto=Smallest (-Os) with LTO
GenFlight.menu.opt.oslto.build.flags.optimize=-Os -flto
GenFlight.menu.opt.o1std=Fast (-O1)
GenFlight.menu.opt.o1std.build.flags.optimize=-O1
GenFlight.menu.opt.o1lto=Fast (-O1) with LTO
GenFlight.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenFlight.menu.opt.o2std=Faster (-O2)
GenFlight.menu.opt.o2std.build.flags.optimize=-O2
GenFlight.menu.opt.o2lto=Faster (-O2) with LTO
GenFlight.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenFlight.menu.opt.o3std=Fastest (-O3)
GenFlight.menu.opt.o3std.build.flags.optimize=-O3
GenFlight.menu.opt.o3lto=Fastest (-O3) with LTO
GenFlight.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenFlight.menu.opt.ogstd=Debug (-Og)
GenFlight.menu.opt.ogstd.build.flags.optimize=-Og
GenFlight.menu.opt.o0std=No Optimization (-O0)
GenFlight.menu.opt.o0std.build.flags.optimize=-O0

LoRa.menu.opt.osstd=Smallest (-Os default)
LoRa.menu.opt.oslto=Smallest (-Os) with LTO
LoRa.menu.opt.oslto.build.flags.optimize=-Os -flto
LoRa.menu.opt.o1std=Fast (-O1)
LoRa.menu.opt.o1std.build.flags.optimize=-O1
LoRa.menu.opt.o1lto=Fast (-O1) with LTO
LoRa.menu.opt.o1lto.build.flags.optimize=-O1 -flto
LoRa.menu.opt.o2std=Faster (-O2)
LoRa.menu.opt.o2std.build.flags.optimize=-O2
LoRa.menu.opt.o2lto=Faster (-O2) with LTO
LoRa.menu.opt.o2lto.build.flags.optimize=-O2 -flto
LoRa.menu.opt.o3std=Fastest (-O3)
LoRa.menu.opt.o3std.build.flags.optimize=-O3
LoRa.menu.opt.o3lto=Fastest (-O3) with LTO
LoRa.menu.opt.o3lto.build.flags.optimize=-O3 -flto
LoRa.menu.opt.ogstd=Debug (-Og)
LoRa.menu.opt.ogstd.build.flags.optimize=-Og
LoRa.menu.opt.o0std=No Optimization (-O0)
LoRa.menu.opt.o0std.build.flags.optimize=-O0

Midatronics.menu.opt.osstd=Smallest (-Os default)
Midatronics.menu.opt.oslto=Smallest (-Os) with LTO
Midatronics.menu.opt.oslto.build.flags.optimize=-Os -flto
Midatronics.menu.opt.o1std=Fast (-O1)
Midatronics.menu.opt.o1std.build.flags.optimize=-O1
Midatronics.menu.opt.o1lto=Fast (-O1) with LTO
Midatronics.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Midatronics.menu.opt.o2std=Faster (-O2)
Midatronics.menu.opt.o2std.build.flags.optimize=-O2
Midatronics.menu.opt.o2lto=Faster (-O2) with LTO
Midatronics.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Midatronics.menu.opt.o3std=Fastest (-O3)
Midatronics.menu.opt.o3std.build.flags.optimize=-O3
Midatronics.menu.opt.o3lto=Fastest (-O3) with LTO
Midatronics.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Midatronics.menu.opt.ogstd=Debug (-Og)
Midatronics.menu.opt.ogstd.build.flags.optimize=-Og
Midatronics.menu.opt.o0std=No Optimization (-O0)
Midatronics.menu.opt.o0std.build.flags.optimize=-O0

# Debug information
Nucleo_144.menu.dbg.none=None
Nucleo_144.menu.dbg.enable=Enabled (-g)
Nucleo_144.menu.dbg.enable.build.flags.debug=-g

Nucleo_64.menu.dbg.none=None
Nucleo_64.menu.dbg.enable=Enabled (-g)
Nucleo_64.menu.dbg.enable.build.flags.debug=-g

Nucleo_32.menu.dbg.none=None
Nucleo_32.menu.dbg.enable=Enabled (-g)
Nucleo_32.menu.dbg.enable.build.flags.debug=-g

Disco.menu.dbg.none=None
Disco.menu.dbg.enable=Enabled (-g)
Disco.menu.dbg.enable.build.flags.debug=-g

Eval.menu.dbg.none=None
Eval.menu.dbg.enable=Enabled (-g)
Eval.menu.dbg.enable.build.flags.debug=-g

STM32MP1.menu.dbg.none=None
STM32MP1.menu.dbg.enable=Enabled (-g)
STM32MP1.menu.dbg.enable.build.flags.debug=-g

GenF0.menu.dbg.none=None
GenF0.menu.dbg.enable=Enabled (-g)
GenF0.menu.dbg.enable.build.flags.debug=-g

GenF1.menu.dbg.none=None
GenF1.menu.dbg.enable=Enabled (-g)
GenF1.menu.dbg.enable.build.flags.debug=-g

GenF2.menu.dbg.none=None
GenF2.menu.dbg.enable=Enabled (-g)
GenF2.menu.dbg.enable.build.flags.debug=-g

GenF3.menu.dbg.none=None
GenF3.menu.dbg.enable=Enabled (-g)
GenF3.menu.dbg.enable.build.flags.debug=-g

GenF4.menu.dbg.none=None
GenF4.menu.dbg.enable=Enabled (-g)
GenF4.menu.dbg.enable.build.flags.debug=-g

GenF7.menu.dbg.none=None
GenF7.menu.dbg.enable=Enabled (-g)
GenF7.menu.dbg.enable.build.flags.debug=-g

GenG0.menu.dbg.none=None
GenG0.menu.dbg.enable=Enabled (-g)
GenG0.menu.dbg.enable.build.flags.debug=-g

GenG4.menu.dbg.none=None
GenG4.menu.dbg.enable=Enabled (-g)
GenG4.menu.dbg.enable.build.flags.debug=-g

GenH7.menu.dbg.none=None
GenH7.menu.dbg.enable=Enabled (-g)
GenH7.menu.dbg.enable.build.flags.debug=-g

GenL0.menu.dbg.none=None
GenL0.menu.dbg.enable=Enabled (-g)
GenL0.menu.dbg.enable.build.flags.debug=-g

GenL1.menu.dbg.none=None
GenL1.menu.dbg.enable=Enabled (-g)
GenL1.menu.dbg.enable.build.flags.debug=-g

GenL4.menu.dbg.none=None
GenL4.menu.dbg.enable=Enabled (-g)
GenL4.menu.dbg.enable.build.flags.debug=-g

GenL5.menu.dbg.none=None
GenL5.menu.dbg.enable=Enabled (-g)
GenL5.menu.dbg.enable.build.flags.debug=-g

GenWB.menu.dbg.none=None
GenWB.menu.dbg.enable=Enabled (-g)
GenWB.menu.dbg.enable.build.flags.debug=-g

GenWL.menu.dbg.none=None
GenWL.menu.dbg.enable=Enabled (-g)
GenWL.menu.dbg.enable.build.flags.debug=-g

3dprinter.menu.dbg.none=None
3dprinter.menu.dbg.enable=Enabled (-g)
3dprinter.menu.dbg.enable.build.flags.debug=-g

BluesW.menu.dbg.none=None
BluesW.menu.dbg.enable=Enabled (-g)
BluesW.menu.dbg.enable.build.flags.debug=-g

Elecgator.menu.dbg.none=None
Elecgator.menu.dbg.enable=Enabled (-g)
Elecgator.menu.dbg.enable.build.flags.debug=-g

ESC_board.menu.dbg.none=None
ESC_board.menu.dbg.enable=Enabled (-g)
ESC_board.menu.dbg.enable.build.flags.debug=-g

Garatronic.menu.dbg.none=None
Garatronic.menu.dbg.enable=Enabled (-g)
Garatronic.menu.dbg.enable.build.flags.debug=-g

GenFlight.menu.dbg.none=None
GenFlight.menu.dbg.enable=Enabled (-g)
GenFlight.menu.dbg.enable.build.flags.debug=-g

LoRa.menu.dbg.none=None
LoRa.menu.dbg.enable=Enabled (-g)
LoRa.menu.dbg.enable.build.flags.debug=-g

Midatronics.menu.dbg.none=None
Midatronics.menu.dbg.enable=Enabled (-g)
Midatronics.menu.dbg.enable.build.flags.debug=-g

# C Runtime Library
Nucleo_144.menu.rtlib.nano=Newlib Nano (default)
Nucleo_144.menu.rtlib.nanofp=Newlib Nano + Float Printf
Nucleo_144.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Nucleo_144.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Nucleo_144.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Nucleo_144.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Nucleo_144.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Nucleo_144.menu.rtlib.full=Newlib Standard
Nucleo_144.menu.rtlib.full.build.flags.ldspecs=

